| =========================================================
| T1136.001 – Local Admin Account Creation
| Splunk SPL – Version 1 (Basic)
| Author: KuRo | SOC Detection Lab
| Date:   2026-04-28
| =========================================================

| -------------------------
| SEARCH 1: Account Created (4720)
| -------------------------
index=windows sourcetype="WinEventLog:Security" EventCode=4720
| table _time, host, SubjectUserName, SubjectDomainName, SubjectLogonId, TargetUserName, TargetSid
| sort _time


| -------------------------
| SEARCH 2: Added to Administrators (4732)
| -------------------------
index=windows sourcetype="WinEventLog:Security" EventCode=4732 TargetUserName="Administrators"
| table _time, host, SubjectUserName, MemberName, TargetUserName
| sort _time


| -------------------------
| SEARCH 3: Both events on same host (correlation)
| Uses join on host within a 10-minute window
| -------------------------
index=windows sourcetype="WinEventLog:Security" EventCode=4720
| rename TargetUserName AS NewAccount, SubjectUserName AS Creator, SubjectLogonId AS LogonId
| eval creation_time=_time
| join type=inner host
    [ search index=windows sourcetype="WinEventLog:Security" EventCode=4732 TargetUserName="Administrators"
    | rename SubjectUserName AS AdminAdder, MemberName AS AddedMember
    | eval add_time=_time ]
| where (add_time - creation_time) >= 0 AND (add_time - creation_time) <= 600
| table creation_time, host, Creator, NewAccount, AddedMember, AdminAdder
| sort creation_time
