| =========================================================
| T1136.001 – Local Admin Account Creation
| Splunk SPL – Version 2 (Advanced with filters & enrichment)
| Author: KuRo | SOC Detection Lab
| Date:   2026-04-28
| =========================================================

index=windows sourcetype="WinEventLog:Security" EventCode=4720

| search NOT TargetUserName IN ("SVC-*", "IT-ADM-*", "svc_*")
| search NOT SubjectUserName IN ("SYSTEM", "*$")

| rename TargetUserName AS NewAccount
| rename SubjectUserName AS Creator
| rename SubjectLogonId AS CreatorLogonId
| eval create_time = _time
| eval create_hour = tonumber(strftime(_time, "%H"))
| eval day_of_week = strftime(_time, "%A")
| eval outside_hours = if(create_hour < 8 OR create_hour >= 18 OR day_of_week IN ("Saturday","Sunday"), "YES", "NO")

| join type=inner host max=5
    [ search index=windows sourcetype="WinEventLog:Security" EventCode=4732 TargetUserName="Administrators"
    | rename SubjectUserName AS AdminAdder, MemberName AS AddedMember, SubjectLogonId AS AdderLogonId
    | eval add_time = _time ]

| where (add_time - create_time) >= 0 AND (add_time - create_time) <= 600

| eval risk_score = 50
| eval risk_score = if(outside_hours="YES", risk_score + 30, risk_score)
| eval risk_score = if(match(NewAccount, "(?i)(temp|test|tmp|backdoor|hack|sys\$)"), risk_score + 20, risk_score)
| eval risk_score = if(Creator!=AdminAdder, risk_score + 10, risk_score)

| eval severity = case(
    risk_score >= 90, "CRITICAL",
    risk_score >= 70, "HIGH",
    risk_score >= 50, "MEDIUM",
    true(), "LOW"
  )

| table create_time, host, Creator, NewAccount, AdminAdder, AddedMember, outside_hours, day_of_week, risk_score, severity
| sort - risk_score
| rename create_time AS "Account Created", host AS "Host", Creator AS "Created By",
         NewAccount AS "New Account Name", AdminAdder AS "Added to Admins By",
         AddedMember AS "Member Added", outside_hours AS "Outside Business Hours",
         day_of_week AS "Day", risk_score AS "Risk Score", severity AS "Severity"
