title: LSASS Dump via comsvcs MiniDump
id: 06f0e2d7-1329-4c2b-8f93-fc8f38630593
status: test
description: Detects LSASS dump using comsvcs.dll MiniDump via rundll32
author: KuRo
date: 2026/05/05
tags:
    - attack.t1003.001
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
        CommandLine|contains|all:
            - 'comsvcs'
            - 'MiniDump'
    condition: selection
falsepositives:
    - None expected
level: critical
