title: ProcDump LSASS Memory Dump
id: e0eccb9d-2f2e-4ed7-9043-bd8e2103f056
status: test
description: Detects ProcDump execution targeting LSASS process memory
author: KuRo
date: 2026/05/05
tags:
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
        Image|endswith:
            - '\procdump.exe'
            - '\procdump64.exe'
    condition: selection
falsepositives:
    - Legitimate sysadmin use of ProcDump
level: high
